In [1]:
%matplotlib inline
import pandas as pd

In [2]:
#from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [2]:
titles = pd.read_csv('data/titles.csv', index_col=None, encoding='utf-8')
titles.head()

                   title  year
0    My Brother's Shadow  2017
1              Crazylove  2005
2           The Outsider  1926
3  P=wp L'Energie Sombre  2015
4           Noor-E-Islam  1957

In [20]:
titles.columns, titles.index

(Index(['title', 'year'], dtype='object'),
 RangeIndex(start=0, stop=244914, step=1))

In [18]:
titles['title'].head().apply(lambda x:x.lower())

0      my brother's shadow
1                crazylove
2             the outsider
3    p=wp l'energie sombre
4             noor-e-islam
Name: title, dtype: object

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [32]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [47]:
titles.iloc[titles['year'].idxmin()]

title    Miss Jerry
year           1894
Name: 69613, dtype: object

In [50]:
titles.sort_values('year').head(2)['title']

69613             Miss Jerry
107320    The Startled Lover
Name: title, dtype: object

In [5]:
titles.iloc[titles['year'].idxmin()]

title    Miss Jerry
year           1894
Name: 69613, dtype: object

In [6]:
titles.sort_values('year').head(2)

                     title  year
69613           Miss Jerry  1894
107320  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [13]:
len(titles[titles['title'].str.contains('Hamlet')])

57

In [25]:
# here I assume that the Exact the title has exact word Hamlet and
# upper and lower case does NOT matter
# solving through Lamda expersion
len(titles[titles['title'].apply(lambda x: x.lower()) == 'hamlet'])

20

In [33]:
# in above if title contain hamlet, then
len(titles[titles['title'].apply(lambda x: x.lower()).str.contains('hamlet')])

57

### How many movies are titled "North by Northwest"?

In [57]:
len(titles[titles['title']=='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [64]:
titles[titles['title']=='Hamlet'].sort_values(by='year').head(1)

         title  year
244684  Hamlet  1910

In [37]:
titles[titles['title'].apply(lambda x: x.lower()).str.contains('hamlet')].sort_values(by='year').head(1)

         title  year
244684  Hamlet  1910

In [48]:
titles[titles['title'].apply(lambda x: x.lower()).str.contains('hamlet')]['year'].min()

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [66]:
titles[titles['title'].str.contains('Treasure Island')].sort_values(by='year')

                                                    title  year
132291                                    Treasure Island  1918
30634                                     Treasure Island  1920
117482                                    Treasure Island  1934
106042                      The Secret of Treasure Island  1938
63161                     Charlie Chan at Treasure Island  1939
182342                                    Treasure Island  1950
108728                          Return to Treasure Island  1954
42387                           Five on a Treasure Island  1957
215954                                    Treasure Island  1972
90344                                     Treasure Island  1973
30725                                     Treasure Island  1985
2069                               Muppet Treasure Island  1996
211634                               Treasure Island (II)  1999
70848                                     Treasure Island  1999
96288   Treasure Island Kids: The Monster of Treasure ...  2006
85292                          Pirates of Treasure Island  2006
13318   Treasure Island Kids: The Battle of Treasure I...  2006
129460  Treasure Island Kids: The Mystery of Treasure ...  2006
239849             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [53]:
len(titles[titles['year']==1950])

1113

### How many movies were made in the year 1960?

In [69]:
len(titles[titles['year']==1960])

1549

### How many movies were made from 1950 through 1959?

In [80]:
len(titles[(titles['year']<=1959) & (titles['year']>=1950)])

12934

In [56]:
len(titles[titles['year']//10*10==1950])

12934

### In what years has a movie titled "Batman" been released?

In [81]:
titles[titles['title']=='Batman']['year']

159317    1943
218714    1989
Name: year, dtype: int64

In [82]:
cast.head(5)

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles were there in the movie "Inception"?

In [95]:
cast[cast['title']=='Inception']['year'].value_counts()

2010    78
Name: year, dtype: int64

In [70]:
c=cast
len(c[c['title']=='Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [99]:
cast[(cast['title']=='Inception') & cast['n'].notnull()]['year'].value_counts()

2010    51
Name: year, dtype: int64

In [72]:
c=cast
len(c[(c['title']=='Inception') & (c.n.isnull())])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [102]:
cast[(cast['title']=='Inception') & (cast['n'].isnull())]['year'].value_counts()

2010    27
Name: year, dtype: int64

In [73]:
c=cast
len(c[(c['title']=='Inception') & (c.n.notnull())])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [69]:
castOfNbN = cast[(cast['title']=='North by Northwest') & (cast['n'].notnull())].sort_values(by=['year','n'])[['year','name','n']]
castOfNbN

         year                  name     n
871426   1959            Cary Grant   1.0
3518333  1959       Eva Marie Saint   2.0
1457165  1959           James Mason   3.0
3157232  1959   Jessie Royce Landis   4.0
356707   1959        Leo G. Carroll   5.0
3048272  1959  Josephine Hutchinson   6.0
1695173  1959           Philip Ober   7.0
1275337  1959         Martin Landau   8.0
2447081  1959         Adam Williams   9.0
1811387  1959          Edward Platt  10.0
665768   1959     Robert Ellenstein  11.0
2295714  1959          Les Tremayne  12.0
464736   1959       Philip Coolidge  13.0
1508344  1959         Patrick McVey  14.0
206471   1959          Edward Binns  15.0
1384780  1959             Ken Lynch  16.0

In [77]:
c=cast
c[(c['title']=='North by Northwest') & (c.n.notnull())].sort_values(by='n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [119]:
cast[(cast['year']==1972) & (cast['title']=='Sleuth')].sort_values(by='n')['name']

1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

In [79]:
c=cast
c[(c['title']=='Sleuth') & (c.year==1972)].sort_values(by='n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [121]:
cast[(cast['year']==2007) & (cast['title']=='Sleuth')].sort_values(by='n')['name']

326774           Michael Caine
1293634               Jude Law
1805907          Harold Pinter
260242         Kenneth Branagh
373877     Alec (II) Cawthorne
2724552      Eve (II) Channing
3370424      Carmel O'Sullivan
Name: name, dtype: object

In [123]:
cast[(cast['title']=='Sleuth')].sort_values(by=['year','n'])

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
326774,Sleuth,2007,Michael Caine,actor,Andrew,1.0
1293634,Sleuth,2007,Jude Law,actor,Milo,2.0
1805907,Sleuth,2007,Harold Pinter,actor,Man on T.V.,3.0
260242,Sleuth,2007,Kenneth Branagh,actor,Other Man on T.V.,NaN
373877,Sleuth,2007,Alec (II) Cawthorne,actor,Inspector Doppler,NaN
2724552,Sleuth,2007,Eve (II) Channing,actress,Marguerite Wyke,NaN
3370424,Sleuth,2007,Carmel O'Sullivan,actress,Maggie,NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [128]:
len(cast[(cast['year']==1921) & (cast['title']=='Hamlet') & (cast['n'].notnull())])

9

### How many roles were credited in Branaghs 1996 Hamlet?

In [85]:
c= cast
len(c[(c.title == 'Hamlet') & (c.year==1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

In [90]:
c = cast
c[c.character == 'The Stranger'].name.nunique()

202

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?